#include <stdio.h>

////배열, 단일 for문으로 입력받고 다중 for문으로 최솟값 찾기
//int main() {
//    int num[3][3];
//    int i, j;
//    for (int i = 0; i < 9; i++) {
//        scanf("%d", &num[i / 3][i % 3]); //0,0 0,1 0,2 1,0 이런 식으로 입력됨..오
//    }
//    int min = num[0][0];
//
//    for (int i = 0; i < 3; i++) {
//        for (int j = 0; j < 3; j++) {
//            if (num[i][j] < min) {
//                min = num[i][j];
//            }
//        }
//    }
//
//        printf("%d", min);
//
//    return 0;
//}
// 
////------------------------------------------------------------------------
////세 개의 자연수 A, B, C가 주어질 때 A × B × C를 계산한 결과에 0부터 9까지 각각의 숫자가 몇 번씩 쓰였는지를 구하는 프로그램
//int main() {
//	int A, B, C;
//	scanf("%d", &A);
//	scanf("%d", &B);
//	scanf("%d", &C);
//	int num[10] = { 0 }; //0 1 2 3 ... 9
//	int n[9] = {A * B * C}; //9칸에 최대 9자리인 숫자를 할당 <<<얘를 문자열로 바꾸고 싶 은 데.....
//
//	for (int j = 0; j < 10; j++) {
//		printf("%d\n", n[j]);
//	}
//
//
//	for (int i = 0; i < 9; i++) { 
//		for (int j = 0; j < 10; j++) { //한 칸마다 10번씩 총 9칸을 0 1 2 ... 9인지 맞춰봄
//			if (n[i] == j) {
//				num[j] += 1; //맞으면 num[j]에 1 더함
//			}
//		}
//	}
//	
//	for (int j = 0; j < 10; j++) {
//		printf("%d\n", num[j]);
//	}
//
//	return 0;
//}

////------------------------------------------------------------------------
//// 정수의 개수 찾기
//int main() {
//	int N, V, sum=0;
//	int num[101];
//	scanf("%d", &N);
//	for (int i = 0; i < N; i++) {
//		scanf("%d", &num[i]);
//	}
//
//	scanf("%d", &V);
//
//	for (int i = 0; i < N; i++) {
//		if (num[i] == V) {
//			sum += 1;
//		}
//	}
//
//	printf("%d", sum);
//
//	return 0;
//}
////------------------------------------------------------------------------
////수열 A에서 X보다 작은 수를 모두 출력
//int main() {
//	int N, X;
//	int A[10000];
//	scanf("%d %d", &N, &X);
//	for (int i = 0; i < N; i++) {
//		scanf("%d", &A[i]);
//	}
//
//	for (int i = 0; i < N; i++) {
//		if (A[i] < X) {
//			printf("%d ", A[i]);
//		}
//	}
//
//	return 0;
//}

////------------------------------------------------------------------------
////최대최소(오 류 나 네..)
//int main() {
//	int N;
//	scanf("%d", &N);
//	int num[1000000];
//
//	for (int i = 0; i < N; i++) {
//		scanf("%d", &num[i]);
//	}
//
//	int min = num[0];
//	int max = num[0];
//
//	for (int i = 0; i < N; i++) {
//		if (num[i] <= min) {
//			min = num[i];
//		}
//	}
//
//	for (int i = 0; i < N; i++) {
//		if (num[i] >= max) {
//			max = num[i];
//		}
//	}
//
//	printf("%d %d", min, max);
//
//	return 0;
//}
////------------------------------------------------------------------------
////최댓값과 그거의 인덱스 출력
//int main() {
//	int n[9];
//	for (int i = 0; i < 9; i++) {
//		scanf("%d", &n[i]);
//	}
//
//	int max = n[0];
//	int num = 0;
//
//	for (int i = 0; i < 9; i++) {
//		if (n[i] > max) {
//			max = n[i];
//		}
//	}
//
//	for (int i = 0; i < 9; i++) {
//		if (n[i] == max) {
//			num = i+1;
//		}
//	}
//
//	printf("%d\n%d", max, num);
//
//	return 0;
//}
////------------------------------------------------------------------------
//// N개의 바구니. 
//// M번 공넣기
//// i번 바구니부터 j번 바구니까지 k번이 적힌 공을 넣을 거...
//
//int main() {
//	int N, M, i, j, k;
//	int ball[101] = { 0 };
//	scanf("%d %d", &N, &M);
//
//	//M번 공넣음 
//	for (int a = 0; a < M; a++) {
//		scanf("%d %d %d", &i, &j, &k);
//		for (int c = i; c <= j; c++) {
//			ball[c-1] = k; //바구니는 1부터 시작인데 인덱스는 0부터 시작이니까
//		}
//	}
//
//	//바구니 N개 출력
//	for (int a = 0; a <N; a++) {
//		printf("%d ", ball[a]);
//	}
//
//	return 0;
//}
////------------------------------------------------------------------------
//// N개의 바구니. 
//// 바구니 번호와 같은 숫자의 공
//// M번 공 바꿀 거
//// 바구니 2개 골라서 서로 바꿈
//
//int main() {
//	int N, M, i, j;
//	int ball[101];
//	scanf("%d %d", &N, &M);
//	
//	for (int a = 0; a < N; a++) {          //바구니에 자기 숫자 공 넣어주기
//		ball[a] = a + 1;      //공은 1번부터
//	}
//
//	for (int a = 0; a < M ; a++) {          //공 바꾸기
//		scanf("%d %d", &i, &j);
//		int A = ball[i-1];
//		int B = ball[j-1];
//		ball[i-1] = B;
//		ball[j-1] = A;
//	}
//
//	for (int a = 0; a < N; a++) {
//		printf("%d ", ball[a]);
//	}
//
//	return 0;
//}
////------------------------------------------------------------------------
////번호 안 불린 사람 찾기
//int main() {
//	int n;
//	int stu[30] = { 0 };
//
//	//과제 낸 번호
//	for (int i = 0; i < 28; i++) {
//		scanf("%d", &n);
//		stu[n - 1] = n;
//	}
//
//	for (int i = 0; i < 30; i++) {
//		if (stu[i] == 0) {
//			printf("%d\n", i + 1);
//		}
//	}
//	return 0;
//}
////------------------------------------------------------------------------
////나머지
//
//int main() {
//        int n, sum = 0;
//        int N[10];
//
//        for (int i = 0; i < 10; i++) {
//            scanf("%d", &n);
//            N[i] = (n % 42); //나머지를 배열에 할당
//        }
//
//        for (int i = 0; i < 10; i++) {
//            int count = 0;
//            for (int j = i + 1; j < 10; j++) {
//                if (N[i] == N[j]) {
//                    count += 1;
//                }
//            }
//            if (count == 0) {
//             sum += 1;
//            }
//            
//        }
//        printf("%d", sum);
// 
//	return 0;
//}
////------------------------------------------------------------------------
//뒤집기? 
//int main() {
//	int bowl[100];
//	int opp[100];
//	int N, M;
//	int i, j;
//	scanf("%d %d", N, M);
//	for (int a = 0; a < M; a++) {
//		scanf("%d %d", i, j);
//		for (int b = i; b <= j; b++) {
//
//		}
//	}
//	
//
//	return 0;
//}
////------------------------------------------------------------------------
//점수 조작
//점수 중 최댓값 M
//모든 점수를 점수/M*100 함
//시험 본 과목 개수 N
int main() {
	int N, sum=0;
	scanf("%d", &N);
	int s[1000];

	for (int i = 0; i < N; i++) {
		scanf("%d", &s[i]);
	}

	int max = s[0];

	for (int i = 0; i < N; i++) {
		if (s[i] > max) {
			max = s[i];
		}
	}

	printf("%d", max);

	for (int i = 0; i < N; i++) {
		if (s[i] != max) {
			s[i] = (s[i] / max) * 100;
		}
		else if (s[i] == max) {
			s[i] = max;
		}
	}

	for (int i = 0; i < N; i++) {
		sum += s[i];
	}

	printf("%d", sum / N);



}