#include <stdio.h>

int main() {
    short M[2][2] = { {10, 20}, {30, 40} }; 
    short* ap;
    short c;
 
    ap = M[0]; 
    c = *ap; //c = 10 (M[0]의 참조값) 
    ap++; // ap = M[0]+1 = M[0][1] (1차원이므로 1을 더하면 한 칸 오른쪽으로) 

    c += *ap; //c = c + 20 = 10 + 20 = 30
    ap += 2; // ap = M[0][1] + 2 = M[0][3]
    c += *ap; //c = 30 + 40 = 70

    c += *ap--; //c = c + 40 = 110 , ap = M[0][3] - 1 = M[0][2]
    c += *--ap; // ap = M[0][2] - 1 = M[0][1] , c = 110 + 20 = 130
    c += *ap; // c = 130 + 20 = 150
    c += ap[-1]; //c = 150 + 10 = 160
    c += ++*ap; // *ap에 + 1을 하고 c에 저장 / 20 > 21 , c = 160 + 21 = 181 //++*ap 와 *++ap 의 차이를 인지하자
    printf("%d %d %d %d\n", M[0][0], M[0][1], M[1][0], M[1][1]);


    ap++; //ap = M[0][1] + 1 = M[0][2]
    c += ap[1]; // c = 181 + 40 = 221
    printf("%d\n", ++*ap); //31 
    printf("%d\n", c); // 221
    printf("%d %d %d %d\n", M[0][0], M[0][1], M[1][0], M[1][1]);

}

