#include <stdio.h>

////배열, 단일 for문으로 입력받고 다중 for문으로 최솟값 찾기
//int main() {
//    int num[3][3];
//    int i, j;
//    for (int i = 0; i < 9; i++) {
//        scanf("%d", &num[i / 3][i % 3]); //0,0 0,1 0,2 1,0 이런 식으로 입력됨..오
//    }
//    int min = num[0][0];
//
//    for (int i = 0; i < 3; i++) {
//        for (int j = 0; j < 3; j++) {
//            if (num[i][j] < min) {
//                min = num[i][j];
//            }
//        }
//    }
//
//        printf("%d", min);
//
//    return 0;
//}
 
////------------------------------------------------------------------------
////세 개의 자연수 A, B, C가 주어질 때 A × B × C를 계산한 결과에 0부터 9까지 각각의 숫자가 몇 번씩 쓰였는지를 구하는 프로그램
//int main() {
//	int A, B, C;
//	scanf("%d", &A);
//	scanf("%d", &B);
//	scanf("%d", &C);
//	int num[10] = { 0 }; //0 1 2 3 ... 9
//	int n[9] = {A * B * C}; //9칸에 최대 9자리인 숫자를 할당 <<<얘를 문자열로 바꾸고 싶 은 데.....
//
//	for (int j = 0; j < 10; j++) {
//		printf("%d\n", n[j]);
//	}
//
//
//	for (int i = 0; i < 9; i++) { 
//		for (int j = 0; j < 10; j++) { //한 칸마다 10번씩 총 9칸을 0 1 2 ... 9인지 맞춰봄
//			if (n[i] == j) {
//				num[j] += 1; //맞으면 num[j]에 1 더함
//			}
//		}
//	}
//	
//	for (int j = 0; j < 10; j++) {
//		printf("%d\n", num[j]);
//	}
//
//	return 0;
//}

////------------------------------------------------------------------------
////// 정수의 개수 찾기
//int main() {
//	int N, V, sum=0;
//	int num[101];
//	scanf("%d", &N);
//	for (int i = 0; i < N; i++) {
//		scanf("%d", &num[i]);
//	}
//
//	scanf("%d", &V);
//
//	for (int i = 0; i < N; i++) {
//		if (num[i] == V) {
//			sum += 1;
//		}
//	}
//
//	printf("%d", sum);
//
//	return 0;
//}
////------------------------------------------------------------------------
////수열 A에서 X보다 작은 수를 모두 출력
//int main() {
//	int N, X;
//	int A[10000];
//	scanf("%d %d", &N, &X);
//	for (int i = 0; i < N; i++) {
//		scanf("%d", &A[i]);
//	}
//
//	for (int i = 0; i < N; i++) {
//		if (A[i] < X) {
//			printf("%d ", A[i]);
//		}
//	}
//
//	return 0;
//}

////------------------------------------------------------------------------
////최대최소(오 류 나 네..)
//int main() {
//	int N;
//	scanf("%d", &N);
//	int num[1000000];
//
//	for (int i = 0; i < N; i++) {
//		scanf("%d", &num[i]);
//	}
//
//	int min = num[0];
//	int max = num[0];
//
//	for (int i = 0; i < N; i++) {
//		if (num[i] <= min) {
//			min = num[i];
//		}
//	}
//
//	for (int i = 0; i < N; i++) {
//		if (num[i] >= max) {
//			max = num[i];
//		}
//	}
//
//	printf("%d %d", min, max);
//
//	return 0;
//}
////------------------------------------------------------------------------
////최댓값과 그거의 인덱스 출력
//int main() {
//	int n[9];
//	for (int i = 0; i < 9; i++) {
//		scanf("%d", &n[i]);
//	}
//
//	int max = n[0];
//	int num = 1;
//
//	for (int i = 0; i < 9; i++) {
//		if (n[i] > max) {
//			max = n[i];
//			num = i + 1;
//		}
//	}
//
//	printf("%d\n%d", max, num);
//
//	return 0;
//}
////------------------------------------------------------------------------
// N개의 바구니. 
// M번 공넣기
// i번 바구니부터 j번 바구니까지 k번이 적힌 공을 넣음
//
//int main() {
//	int N, M, i, j, k;
//	int ball[101] = { 0 };
//	scanf("%d %d", &N, &M);
//
//	//M번 공넣음 
//	for (int a = 0; a < M; a++) {
//		scanf("%d %d %d", &i, &j, &k);
//		for (int c = i; c <= j; c++) {
//			ball[c-1] = k; //바구니는 1부터 시작인데 인덱스는 0부터 시작이니까
//		}
//	}
//
//	//바구니 N개 출력
//	for (int a = 0; a < N; a++) {
//		printf("%d ", ball[a]);
//	}
//
//	return 0;
//}
////------------------------------------------------------------------------
//// N개의 바구니. 
//// 바구니 번호와 같은 숫자의 공
//// M번 공 바꿈
//// 바구니 2개 골라서 서로 바꿈
//
//int main() {
//	int N, M, i, j;
//	int ball[100];
//	scanf("%d %d", &N, &M);
//	
//	for (int a = 0; a < N; a++) {          //바구니에 자기 숫자 공 넣어주기
//		ball[a] = a + 1;      //공은 1번부터
//	}
//
//	for (int a = 0; a < M ; a++) {          //공 바꾸기
//		scanf("%d %d", &i, &j);
//		int A = ball[i-1];
//		int B = ball[j-1];
//		ball[i-1] = B;
//		ball[j-1] = A;
//	}
//	for (int a = 0; a < N; a++) {
//		printf("%d ", ball[a]);
//	}
//
//	return 0;
//}
////------------------------------------------------------------------------
////번호 안 불린 사람 찾기
//int main() {
//	int n;
//	int stu[30] = { 0 };
//
//	//과제 낸 번호
//	for (int i = 0; i < 28; i++) {
//		scanf("%d", &n);
//		stu[n - 1] = n;
//	}
//
//	for (int i = 0; i < 30; i++) {
//		if (stu[i] == 0) {
//			printf("%d\n", i + 1);
//		}
//	}
//	return 0;
//}
////------------------------------------------------------------------------
////서로 다른 나머지의 개수 찾기
//
//int main() {
//	int n, sum = 0;
//	int N[10];
//
//	for (int i = 0; i < 10; i++) {
//		scanf("%d", &n);
//		N[i] = (n % 42); //나머지를 배열에 할당
//	}
//
//	for (int i = 0; i < 10; i++) {
//		int count = 0;
//		for (int j = i + 1; j < 10; j++) {
//			if (N[i] == N[j]) { // 겹치는 숫자가 있다 = 서로 다른 나머지의 개수에 미포함
//				count += 1;
//			}
//		}
//		if (count == 0) { // = 겹치는 숫자가 없다 = 서로 다른 나머지 개수(=sum+ +1
//			sum += 1;
//		}
//	}
//	printf("%d", sum);
//
//	return 0;
//
//} // ctrl+D : 줄정렬
//////------------------------------------------------------------------------
////뒤집기? 보류!!!
////바구니 N개
////M번 뒤집음
////i번부터 j번까지 역순
//
//int main() {
//	int bowl[100];
//	int opp[100];
//	int N, M;
//	int i, j;
//	scanf("%d %d", N, M);
//	for (int a = 0; a < M; a++) {
//		scanf("%d %d", i, j);
//		for (int b = i; b <= j; b++) {
//
//		}
//	}
//	
//
//	return 0;
//}

//////------------------------------------------------------------------------
////점수 조작
////점수 중 최댓값 M
////모든 점수를 점수/M*100 함
////시험 본 과목 개수 N
// 
//int main() {
//	float N, sum=0.0;
//	scanf("%f", &N);
//	float s[1000];
//
//	for (int i = 0; i < N; i++) {
//		scanf("%f", &s[i]);
//	}
//
//	float max = s[0];
//
//	for (int i = 0; i < N; i++) {
//		if (s[i] > max) {
//			max = s[i];
//		}
//	}
//
//	for (int i = 0; i < N; i++) {
//			s[i] = (float)s[i] / (float)max * 100;
//	
//	}
//
//	for (int i = 0; i < N; i++) {
//		sum += s[i];
//	}
//
//	printf("%.14f", (float)sum / (float)N);
//}

//////------------------------------------------------------------------------
//////------------------------------------------------------------------------
//
//int main() {
//	short a, b, c;
//	a = 10;
//	*&b = *&a + 2; //*&n : n의 주소가 가리키는 거 (n의 값)
//	*&a += 4;
//	c = a + b;
//	printf("%d\n", c);
//}

//////------------------------------------------------------------------------

//int main() {
//	long M[3] = { 10, 20, 30 };
//	long K;
//	K = *M + M[1] + *(M + 1); //* > 참조값
//	K += *&M[2] + *M + 1;
//	printf("%d\n", K);
//
//}

////------------------------------------------------------------------------

//int main() {
//	char M[] = { 'A' , 'B' , 'C', 'D' };
//	int N = sizeof(M);
//	int a;
//	*&M[0] += 32; //아스키코드 참고 
//	*(M + 1) += 1;
//	++*(M + 2);
//	*(M + 3) += 2;
//	for (a = 0; a < N; a++)
//		putchar(*(M + a));
//}

////------------------------------------------------------------------------
//
//int main() {
//	int M[2][3] = { { 10, 20 , 30} , {40 ,50,60} };
//	int a=0;
//	/*a = M[0][0] + M[0][1] + M[1][0] + M[1][1];
//	a += (*&M[1][0] + *M[0] + *(M[1] + 1));
//	a -= **M;*/
//	printf("%d\n", M); //2차원
//	printf("%d\n", M+1); //2차원+1 : 차원을 하나 건너뜀 (다음 행으로. . .)
//	printf("%d\n", *(M+1)); //1차원
//	printf("%d\n", *(M + 1) + 1); //1차원+1 : 칸을 하나 건너뜀 (다음 열으로!)
//	a += *(*(M + 1) + 1);
//	printf("%d\n", a);
//}

////------------------------------------------------------------------------

//int main(){
//	short M[2][2] = { {10,20}, {30,40} };
//	short a, sum = 0;
//	*M[0] = 15; //o
//	*(M[0] + 1) = 25;
//	*M[1] = 35; 
//	M[0][3] = 45; //행렬을 일차원으로 읽을 때 o
//
//	**M = 17; //o
//	*(*(M + 1) + 1) = 47; //x !!!!!!!!!!!!!!!! 차원이 일차원이 됨!!
//	*(*M + 1) = 27; 
//	**(M + 1) = 37; //x !!!!!!!!!!!!!!!!!!!!! ㅠ //포인터가 앞에 달려있지 않을 땐 차원이 아직 이차원
//	M[1][-1] += 2; //[1][0]이 한 칸 뒤로 간 거
//	for (a = 0; a < 4; a++)
//	sum += M[0][a];
//	printf("%d\n", sum);
//}
//
////숙제: 주석 단 거 말고 원래 코드 보면서 설명할 수 있을 때까지 반복해오기!
//////------------------------------------------------------------------------
//
//int main() {
//	short M[2][2][2] = { {{10,20},{30,40}} , {{50,60},{70,80}} };
//	int a, b, c;
//	short cnt = 0;
//
//	++*M[0][0];
//	*M[0][1] += 2;
//	*M[1][0] += 3;
//	*M[1][1] += 4;
//	++*(M[0][0] + 1);
//
//	*(M[0][1] + 1) += 2;
//	*(M[1][0] + 1) += 3;
//	*(*(M[0] + 0)) += 1;
//	*(*(M[0] + 0) + 1) = *(*M[0] + 1) + *(**M + 1) + 2;
//	*(*(M[0] + 1)) = *(*(*M+1)) + 3
//
//		for (a = 0; a < 8; a++) {
//			if (M[0][0][a] >= 40);
//			M[0][0][a] /= 2;
//     	}
//
//
//}
int main() {
	short M[2][2][2] = { {{10,20},{30,40}} , {{50,60},{70,80}} }; 
	int a, b, c;
	short cnt = 0;

	++*M[0][0]; 
	*M[0][1] += 2;
	*M[1][0] += 3;
	*M[1][1] += 4;
	++*(M[0][0] + 1);



	*(M[0][1] + 1) += 2;
	*(M[1][0] + 1) += 3;
	*(*(M[0] + 0)) += 1;


	*(*(M[0] + 0) + 1) = *(*M[0] + 1) + *(**M + 1) + 2;

	*(*(M[0] + 1)) = *(*(*M + 1)) + 3;
	printf("%d", *(*(M[0] + 1)));


	/*	for (a = 0; a < 8; a++) {
			if (M[0][0][a] >= 40);
			M[0][0][a] /= 2;
     	}

		for (a = 0; a < 2; a++)
			for (b = 0; b < 2; b++)
				for (c = 0; c < 2; c++)
					if (M[a][b][c] / 10 == 2)
						cnt++;
		printf("%d\n", cnt);*/
	for (a = 0; a < 2; a++)
		for (b = 0; b < 2; b++)
			for (c = 0; c < 2; c++) {
				printf("%d ", M[a][b][c]);
			}
}